src/DataProcessors/СозданиеБарКодовВЗаказеПоставщику/СозданиеБарКодовВЗаказеПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СозданиеБарКодовВЗаказеПоставщику</name>
</mdclass:DataProcessor>

src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <basedOn>Document.ЗаявкаНаЗакупку</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ДоговорыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаЗакупку</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаявкаНаЗакупку</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дополнение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>НЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераБФ</name>
    <attributes>
      <name>НомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НумераторБарКодов/НумераторБарКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НумераторБарКодов</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСброса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/СозданиеБарКодовВЗаказеПоставщику/Forms/СозданиеБарКодов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ЗаказПоставщику = ЭтаФорма.Параметры.ЗП;
ЗаказПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаказПоставщикуПриИзмененииНаСервере()
ТаблицаТоваров.Очистить();
Подразделение = ЗаказПоставщику.Подразделение;
	Для каждого ТЧ Из ЗаказПоставщику.ТабличнаяЧасть Цикл
	ТЧ_ТТ = ТаблицаТоваров.Добавить();
	ТЧ_ТТ.Материал = ТЧ.МПЗ;
	ТЧ_ТТ.Количество = ТЧ.Количество; 
		Если Не ТЧ.МПЗ.Товар.Пустая() Тогда
		Результат = ПолучитьНоменклатуруПоТовару(ТЧ.МПЗ.Товар);
			Если Результат.Количество() = 1 Тогда
			ТЧ_ТТ.Номенклатура = Результат[0].Значение;
			БарКодыСуществуют(ТЧ_ТТ,ТЧ.МПЗ);
			ИначеЕсли Результат.Количество() = 0 Тогда 
			ТЧ_ТТ.Комментарий = "Спецификация не найдена";
			ИначеЕсли Результат.Количество() > 0 Тогда 
			ТЧ_ТТ.Комментарий = "Найдено несколько спецификаций";
			КонецЕсли; 
		Иначе
		ТЧ_ТТ.Комментарий = "Материал не прикреплен к товару";	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщикуПриИзменении(Элемент)
ЗаказПоставщикуПриИзмененииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура БарКодыСуществуют(ТЧ,МПЗ)
	Для каждого ТЧ_ЗП Из ЗаказПоставщику.БарКоды Цикл
		Если ТЧ_ЗП.МПЗ = МПЗ Тогда
		ТЧ_БК = ТЧ.БарКоды.Добавить();
		ТЧ_БК.БарКод = ТЧ_ЗП.БарКод;
		ТЧ_БК.ДатаСоздания = ТЧ_ЗП.ДатаСоздания;
		ТЧ.Количество = ТЧ.Количество - 1;
		КонецЕсли;
	КонецЦикла;
		Если ТЧ.Количество > 0 Тогда
		ТЧ.КоличествоСоздать = ТЧ.Количество;
		ТЧ.Пометка = Истина;
		Иначе
		ТЧ.Комментарий = "Бар-коды созданы полностью";
		КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруПоТовару(Товар)
Запрос = Новый Запрос;
СписокНоменклатуры = Новый СписокЗначений;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Товар = &Товар
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус"; 
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("Товар", Товар);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
   	СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
Возврат(СписокНоменклатуры);
КонецФункции

&НаКлиенте
Процедура ТаблицаТоваровКоличествоСоздатьПриИзменении(Элемент)
	Если Элементы.ТаблицаТоваров.ТекущиеДанные.КоличествоСоздать > Элементы.ТаблицаТоваров.ТекущиеДанные.Количество Тогда
	Элементы.ТаблицаТоваров.ТекущиеДанные.КоличествоСоздать = 0;
	Сообщить("Создаваемое кол-во не может превышать требуемое!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьБарКодыНаСервере()
Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Подразделение);
	Если Н.Пустая() Тогда
	Сообщить("Не создан нумератор бар-кодов для подразделения!");
	Возврат(Ложь);
	КонецЕсли; 
		Если КонецДня(Н.ДатаСброса) < КонецДня(ТекущаяДата()) Тогда
		Нумератор = Н.ПолучитьОбъект();
		Нумератор.СледующийНомер = 1;
		Нумератор.ДатаСброса = КонецГода(ТекущаяДата());
		Нумератор.Записать();					
		КонецЕсли;
СледующийНомер = Н.СледующийНомер;
НаДату = ТекущаяДата();
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ЗП_Объект = ЗаказПоставщику.ПолучитьОбъект();		
		Для каждого ТЧ Из ТаблицаТоваров Цикл 
			Если ТЧ.Пометка Тогда
				Для к = 1 По ТЧ.КоличествоСоздать Цикл
				СледующийНомер = СледующийНомер + 1;
				ТЧ_ЗП_БК = ЗП_Объект.БарКоды.Добавить();
				ТЧ_ЗП_БК.МПЗ = ТЧ.Материал;
				ТЧ_ЗП_БК.ДатаСоздания = НаДату;
				ТЧ_ЗП_БК.БарКод = ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(ТЧ.Номенклатура.Товар.Код)+Сред(Год(НаДату),4)+Формат(Месяц(НаДату),"ЧЦ=2; ЧВН=")+Подразделение.Код+Формат(СледующийНомер,"ЧЦ=6; ЧВН=; ЧГ=");
				ТЧ_БК = ТЧ.БарКоды.Добавить();
				ТЧ_БК.БарКод = ТЧ_ЗП_БК.БарКод;
				ТЧ_БК.ДатаСоздания = НаДату;
				КонецЦикла;          
			ТЧ.Количество = ТЧ.Количество - ТЧ.КоличествоСоздать;
			ТЧ.КоличествоСоздать = 0;
			ТЧ.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	ЗП_Объект.Записать(РежимЗаписиДокумента.Запись);
	Нумератор = Н.ПолучитьОбъект();
	Нумератор.СледующийНомер = СледующийНомер;
	Нумератор.Записать();
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	КонецПопытки;
Возврат(Ложь);
КонецФункции

&НаКлиенте
Процедура СоздатьБарКоды(Команда)
СоздатьБарКодыНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
ТабДок = Новый ТабличныйДокумент;

Макет = Документы.ЗаказПоставщику.ПолучитьМакет("Макет2");

ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблБарКод = Макет.ПолучитьОбласть("БарКод");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.Номер = СокрЛП(Параметры.ЗП.Номер)+" от "+Параметры.ЗП.Дата;
ТабДок.Вывести(ОблШапка);
	Для каждого ТЧ Из ТаблицаТоваров Цикл
		Если ТЧ.БарКоды.Количество() > 0 Тогда  
			Для каждого ТЧ_БК Из ТЧ.БарКоды Цикл
				Если ТЧ_БК.ДатаСоздания = НачалоДня(ТекущаяДата()) Тогда
				ОблБарКод.Параметры.Наименование = СокрЛП(ТЧ.Номенклатура.Товар.Наименование);
				ОблБарКод.Параметры.Товар = ТЧ.Номенклатура.Товар;
				ОблБарКод.Параметры.БарКод = ТЧ_БК.БарКод;
				ОблБарКод.Параметры.ДатаСоздания = ТЧ_БК.ДатаСоздания;
				ТабДок.Вывести(ОблБарКод);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	 
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);	
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
ТД = ПечатьНаСервере();
ТД.Показать("Бар-коды заказа поставщику");
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры
